src/toir_cf/src/InformationRegisters/торо_НастройкиСтатусовСогласованияДокументов/торо_НастройкиСтатусовСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_НастройкиСтатусовСогласованияДокументов</name>
  <resources>
    <name>Начальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СогласованиеЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ШаблонСообщенияЭлектроннойПочты</name>
    <type>
      <types>CatalogRef.торо_ШаблоныСообщенийИУведомлений</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьВПодборах</name>
    <comment>Не выводить ремонтные работы в форме подбора для документов, имеющих соответствующий статус</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретитьРедактирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьПометкуНаУдаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеОтображатьВСпискеЗадач</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическоеПроведение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ШаблонУведомления</name>
    <type>
      <types>CatalogRef.торо_ШаблоныСообщенийИУведомлений</types>
    </type>
  </resources>
  <resources>
    <name>КомментарийОбязателен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>НомерСтатуса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/CommonForms/торо_ФормаВыбораСтатусаСогласования/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокСтатусов.ЗагрузитьЗначения(Параметры.СписокСледующихСтатусов.ВыгрузитьЗначения());
	ВыделенныйСтатус = Параметры.ВыделенныйСтатус;
	СпособСогласования = Параметры.СпособСогласования;
	
	ЗаполнитьСписокСтатусовСОбязательнымКомментарием();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(ВыделенныйСтатус) Тогда
		НайденноеЗначение = СписокСтатусов.НайтиПоЗначению(ВыделенныйСтатус);
		Если НайденноеЗначение <> Неопределено Тогда
			Элементы.СписокСтатусов.ТекущаяСтрока = НайденноеЗначение.ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ВыбранныйСтатус = Неопределено;
	Если СписокСтатусов.Количество() = 1 Тогда
		ВыбранныйСтатус = СписокСтатусов[0].Значение;
	Иначе
		ТекущиеДанные = Элементы.СписокСтатусов.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ВыбранныйСтатус = ТекущиеДанные.Значение;
		КонецЕсли;
	КонецЕсли;
	
	Если ВыбранныйСтатус = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Не выбран статус!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	Если Не СписокСтатусовСОбязательнымКомментарием.НайтиПоЗначению(ВыбранныйСтатус) = Неопределено
		И Не ЗначениеЗаполнено(Комментарий) Тогда
		ТекстСообщения = НСтр("ru = 'Согласно настройкам способа согласования, для установки выбранного статуса необходимо заполнить комментарий!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Закрыть(Новый Структура("ВыбранныйСтатус, Комментарий", ВыбранныйСтатус, Комментарий));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокСтатусов

&НаКлиенте
Процедура СписокСтатусовПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.СписокСтатусов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
	    Возврат;
	КонецЕсли;
	
	ТекущийСтатус = ТекущиеДанные.Значение;
	Если Не СписокСтатусовСОбязательнымКомментарием.НайтиПоЗначению(ТекущийСтатус) = Неопределено Тогда
		Элементы.Комментарий.ОтметкаНезаполненного = Истина;
	Иначе
		Элементы.Комментарий.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокСтатусовСОбязательнымКомментарием()
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	торо_НастройкиСтатусовСогласованияДокументов.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.торо_НастройкиСтатусовСогласованияДокументов КАК торо_НастройкиСтатусовСогласованияДокументов
	               |ГДЕ
	               |	торо_НастройкиСтатусовСогласованияДокументов.СпособСогласования = &СпособСогласования
	               |	И торо_НастройкиСтатусовСогласованияДокументов.Статус В(&СписокСтатусов)
	               |	И торо_НастройкиСтатусовСогласованияДокументов.КомментарийОбязателен";
	
	Запрос.УстановитьПараметр("СпособСогласования", СпособСогласования);
	Запрос.УстановитьПараметр("СписокСтатусов", СписокСтатусов);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
	    Возврат;
	КонецЕсли;
	
	ВыборкаСтатусов = РезультатЗапроса.Выбрать();
	Пока ВыборкаСтатусов.Следующий() Цикл
	    СписокСтатусовСОбязательнымКомментарием.Добавить(ВыборкаСтатусов.Статус);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
